# Используем официальный образ Node.js в качестве базового
FROM node:18-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости проекта
RUN npm install

# Копируем все файлы проекта в контейнер
COPY . .

# Строим приложение для продакшн-режима
RUN npm run build

# Настроим контейнер для использования порта 3000
EXPOSE 3000

# Указываем команду для запуска продакшн-сервера
CMD ["npm", "start"]
